---
kind: property
id: P:Autodesk.Revit.DB.GroupTypeId.ViewExtents
source: html/90168742-ef7b-9c18-6119-1db87a1e8bc1.htm
---
# Autodesk.Revit.DB.GroupTypeId.ViewExtents Property

Extents.

## Syntax (C#)
```csharp
public static ForgeTypeId ViewExtents { get; }
```